In [1]:
import pandas as pd

In [2]:
insurance = pd.read_csv(r"C:\Users\akshada\Desktop\New folder (2)\insurance.csv")

In [3]:
insurance

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [4]:
insurance.head(n=10)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520
5   31  female  25.740         0     no  southeast   3756.62160
6   46  female  33.440         1     no  southeast   8240.58960
7   37  female  27.740         3     no  northwest   7281.50560
8   37    male  29.830         2     no  northeast   6406.41070
9   60  female  25.840         0     no        NaN  28923.13692

In [5]:
insurance.tail()

      age     sex    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [6]:
insurance.shape

(1338, 7)

In [7]:
insurance.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
charges     float64
dtype: object

In [8]:
insurance.select_dtypes(include = ['float64', 'int64'])

      age     bmi  children      charges
0      19  27.900         0  16884.92400
1      18  33.770         1   1725.55230
2      28  33.000         3   4449.46200
3      33  22.705         0  21984.47061
4      32  28.880         0   3866.85520
...   ...     ...       ...          ...
1333   50  30.970         3  10600.54830
1334   18  31.920         0   2205.98080
1335   18  36.850         0   1629.83350
1336   21  25.800         0   2007.94500
1337   61  29.070         0  29141.36030

[1338 rows x 4 columns]

In [9]:
insurance.describe()

               age          bmi     children       charges
count  1338.000000  1324.000000  1338.000000   1338.000000
mean     39.207025    30.640219     1.094918  13270.422265
std      14.049960     6.094644     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.220000     0.000000   4740.287150
50%      39.000000    30.380000     1.000000   9382.033000
75%      51.000000    34.585000     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [60]:
df = insurance.copy()

In [11]:
df.loc[3, 'sex'] = 'female'
df.loc[1, 'region'] = 'northwest'
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  northwest   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33  female  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [12]:
insurance.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [13]:
print(df.isnull().sum())

age          0
sex          0
bmi         14
children     0
smoker       0
region      17
charges      0
dtype: int64

In [14]:
import numpy as np
df.smoker.replace('NAN', np.nan, inplace = True)

In [15]:
#df.drop(["region"], axis = 1, inplace = True)

In [16]:
#df.groupby(['sex'])['smoker'].value_counts()

In [17]:
#df.groupby(['sex', 'smoker'])['charges'].mean()

In [18]:
#low_bmi = df[df['bmi'] <= 19]
#low_bmi.head()

In [19]:
#low_bmi.reset_index(drop = True, inplace = True)
#low_bmi.head()

In [20]:
#low_bmi.groupby(['sex'])['age'].value_counts().idxmax()

In [21]:
print(df['bmi'].min())
print(df['bmi'].max())
print(df['bmi'].mean())
print(df['bmi'].std())

15.96
53.13
30.64021903323261
6.094644148050681

In [22]:
df.isnull().sum()

age          0
sex          0
bmi         14
children     0
smoker       9
region      17
charges      0
dtype: int64

In [23]:
df["region"].mode()

0    southeast
dtype: object

In [61]:
df["smoker"].dropna(axis = 0, inplace = True)
df["bmi"].fillna(df["bmi"].mean(), inplace = True)
df["region"].fillna("southeast", inplace = True)

In [62]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [26]:
df.children = df.children.astype(float)

In [27]:
df.dtypes

age           int64
sex          object
bmi         float64
children    float64
smoker       object
region       object
charges     float64
dtype: object

In [35]:
df["children"] = df["children"].astype(int)

In [36]:
df.dtypes

age           int64
sex          object
bmi         float64
children      int32
smoker       object
region       object
charges     float64
dtype: object

In [70]:
print(df.age.min())
print(df.age.max())

18
64

In [71]:
print(df.bmi.min())
print(df.bmi.max())

15.96
53.13

In [38]:
df["bmi"].head()

0    27.900
1    33.770
2    33.000
3    22.705
4    28.880
Name: bmi, dtype: float64

In [39]:
df["bmi"] = df["bmi"]/df["bmi"].max()

In [40]:
df["bmi"].head()

0    0.525127
1    0.635611
2    0.621118
3    0.427348
4    0.543572
Name: bmi, dtype: float64

In [44]:
df["bmi"] = (df["bmi"] - df["bmi"].min())/(df["bmi"].max() - df["bmi"].min())

In [45]:
df["bmi"].head()

0    0.321227
1    0.479150
2    0.458434
3    0.181464
4    0.347592
Name: bmi, dtype: float64

In [49]:
df["bmi"] = (df["bmi"] - df["bmi"].mean())/df["bmi"].std()

In [50]:
df["bmi"].head()

0   -0.451984
1    0.516240
2    0.389233
3   -1.308869
4   -0.290338
Name: bmi, dtype: float64

In [52]:
bins = np.linspace(df["charges"].min(), df["charges"].max(), 4)
bins

array([ 1121.8739 , 22004.72527, 42887.57664, 63770.42801])

In [53]:
group_names = ["Low", "Medium", "High"]

In [65]:
df["binned_charges"] = pd.cut(df["charges"], bins, labels = group_names)

In [69]:
sex_num = pd.get_dummies(df["sex"])
sex_num.head()

   female  male
0       1     0
1       0     1
2       0     1
3       0     1
4       0     1

In [66]:
df.head()

   age     sex     bmi  children smoker     region      charges binned_charges
0   19  female  27.900         0    yes  southwest  16884.92400            Low
1   18    male  33.770         1     no  southeast   1725.55230            Low
2   28    male  33.000         3     no  southeast   4449.46200            Low
3   33    male  22.705         0     no  northwest  21984.47061            Low
4   32    male  28.880         0     no  northwest   3866.85520            Low